
print('1) Простейший числовой ряд - это сумма членов ряда от одного (не всегда) до бесконечности (плюс или минус),\n'
      'члены ряда зависят от общего члена ряда (ядро) и от переменной (счетчик).')
print()
print('2) Исследование ряда на сходимость - это важная задача.\n'
      'Ряд сходится - это значит, что бесконечная сумма членов ряда равна конечному числу.')
print()
print('3) Чему равен предел?\n'
      'Lim 3x^2-15 = 3*5^2-15 = 60\n'
      'x->5')
print()
print('4) Чему равен предел?\n'
      'Lim 10000^30000000000-x = (lim 10000^30000000000)-(lim x) = 10000^30000000000 - ထ  = -ထ\n'
      'x->ထ                       x->ထ                    x->ထ\n'
      'При решении использовали свойство бесконечности: a - (+ထ ) = -ထ')
print()
print('5) Чему равен предел?\n'
      '      5x^2-2x\n'
      'lim   ------- = \n'
      'x->ထ   x^2+x \n'
      '\n'
      'разделим числитель и знаменатель общего члена ряда на x^2 и получаем:\n'
      '\n'
      '5 - 2/x \n'
      '------- \n'
      '1 + 1/x \n'
      '\n'
      '2/x и 1/x стремятся к нулю по мере приближения x к бесконечности, в итоге: \n'
      '\n'
      '5 - 0    5\n'
      '----- = --- = 5 \n'
      '1 + 0    1\n')